## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_role_assignment.aks_to_acr_1 will be created
  + resource "azurerm_role_assignment" "aks_to_acr_1" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d3fc6f7f-2699-4169-aa9b-5c4e3f35dd34"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-terraform-gh-actions-01/providers/Microsoft.ContainerRegistry/registries/gmezanregistry001"
      + skip_service_principal_aad_check = true
    }

  # module.aks.azurerm_kubernetes_cluster.k8s will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "k8s" {
        id                                  = "/subscriptions/a2b47c47-f61e-492e-9529-9ff0c74be671/resourceGroups/rg-terraform-gh-actions-01/providers/Microsoft.ContainerService/managedClusters/cluster-selected-hookworm"
        name                                = "cluster-selected-hookworm"
        tags                                = {}
        # (31 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "agentpool"
            tags                          = {}
            # (30 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>